BAS BMEKZU Project/src/Reports/ИНАГРО_ЖурналРегистрацииВзвешиваний/ИНАГРО_ЖурналРегистрацииВзвешиваний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИНАГРО_ЖурналРегистрацииВзвешиваний</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Report>

BAS BMEKZU Project/src/Reports/ИНАГРО_ЖурналРегистрацииВзвешиваний/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Получаем необходимую СКД.
	Если ТипОтчета = "ТипВвоз" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_Ввоз");	
		
	ИначеЕсли ТипОтчета = "ТипВывоз" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_Вывоз");
			
	ИначеЕсли ТипОтчета = "ТипВнутр" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_ВнутреннеПеремещение");
		
	ИначеЕсли ТипОтчета = "ТипВзвешивание" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_Взвешивание");
		
	ИначеЕсли ТипОтчета = "ТипВвозВывоз" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_ВвозВывоз");
		
	ИначеЕсли ТипОтчета = "ТипЖДВвоз" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_ВвозЖД");
		
	ИначеЕсли ТипОтчета = "ТипЖДВывоз" Тогда
		НеобходимаяСКД = ПолучитьМакет("СКД_ВывозЖД");
	КонецЕсли; 
		
	// Устанавливаем выбранную СКД как основную.
	СхемаКомпоновкиДанных = НеобходимаяСКД;
	
	// Устанавливаем параметры.
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрПериодОтчета = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	ЗначениеПериодОтчета = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодОтчета);
	Если ЗначениеПериодОтчета <> Неопределено Тогда
		ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПериодОтчета, Период);
	КонецЕсли;
	
	// Устанавливаем параметры.
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрПериодОтчета = Новый ПараметрКомпоновкиДанных("Организация");
	ЗначениеПериодОтчета = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодОтчета);
	Если ЗначениеПериодОтчета <> Неопределено Тогда
		ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПериодОтчета, Организация);
	КонецЕсли;
	
	// Установка параметров шапки своими значениями. 
	Если ТипОтчета = "ТипВвоз" 		 ИЛИ 
		ТипОтчета = "ТипВывоз"     	 ИЛИ
		ТипОтчета = "ТипВнутр"     	 ИЛИ
		ТипОтчета = "ТипВзвешивание" ИЛИ
		ТипОтчета = "ТипВвозВывоз"     Тогда
		
		ПарамКодЕРДПОУ = Новый ПараметрКомпоновкиДанных("ПарамКод");
		ЗначениеКодЕРДПОУ = Организация.КодПоЕДРПОУ;	
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПарамКодЕРДПОУ, ЗначениеКодЕРДПОУ);
		
		ПарамПолноеИмя = Новый ПараметрКомпоновкиДанных("ПарамПолноеИмя");
		ЗначениеПолноеИмя = Организация.НаименованиеПолное;	
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПарамПолноеИмя, ЗначениеПолноеИмя);
		
	Иначе
		
		ПарамПолноеИмя = Новый ПараметрКомпоновкиДанных("ПарамПолноеИмя");
		ЗначениеПолноеИмя = Организация.НаименованиеПолное;	
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПарамПолноеИмя, ЗначениеПолноеИмя);
		
	КонецЕсли;	 

КонецПроцедуры

#КонецОбласти
